# Part 1

In [1]:
import pandas as pd

data = {
    'name' : ['Alice', 'Bob', 'Charlie', 'David', 'Eva'],
    'age' : [23,35,45,36,28],
    'city' : ['New York', 'Los Angeles', 'Chicago', 'Houston', 'Phoenix']
}

df_1 = pd.DataFrame(data)

df_1

      name  age         city
0    Alice   23     New York
1      Bob   35  Los Angeles
2  Charlie   45      Chicago
3    David   36      Houston
4      Eva   28      Phoenix

In [2]:
df_1.iloc[2]

name    Charlie
age          45
city    Chicago
Name: 2, dtype: object

In [3]:
df_1.iloc[:, 1]

0    23
1    35
2    45
3    36
4    28
Name: age, dtype: int64

In [4]:
df_1.iloc[:3]

      name  age         city
0    Alice   23     New York
1      Bob   35  Los Angeles
2  Charlie   45      Chicago

In [5]:
df_1.loc[2]

name    Charlie
age          45
city    Chicago
Name: 2, dtype: object

In [6]:
df_1.loc[: ,"age"]

0    23
1    35
2    45
3    36
4    28
Name: age, dtype: int64

In [7]:
df_1.loc[[0, 4], "city"]

0    New York
4     Phoenix
Name: city, dtype: object

# Task 2

In [8]:
data = {
    'name' : ['Alice', 'Bob', 'Charlie', 'David', 'Eva'],
    'age' : [23,35,45,36,28],
    'city' : ['New York', 'Los Angeles', 'Chicago', 'Houston', 'Phoenix']
}

df_2 = pd.DataFrame(data)

df_2

      name  age         city
0    Alice   23     New York
1      Bob   35  Los Angeles
2  Charlie   45      Chicago
3    David   36      Houston
4      Eva   28      Phoenix

In [9]:
df_2[df_2["age"] > 30]

      name  age         city
1      Bob   35  Los Angeles
2  Charlie   45      Chicago
3    David   36      Houston

In [25]:
#Task 2 # 2. TODO

df_2[(df_2["city"] == "Chicago" ) | (df_2["city"] =="Houston")]

            name  age     city
name
Charlie  Charlie   45  Chicago
David      David   36  Houston

In [11]:
df_2.index = df_2["name"]

df_2.loc["David"]

name      David
age          36
city    Houston
Name: David, dtype: object

In [12]:
df_2.loc[["Bob", "Eva"], ["age", "city"]]

      age         city
name
Bob    35  Los Angeles
Eva    28      Phoenix

# Task 3

In [13]:
data_3 = {
    'Product' : ["Apple", "Banana", "Carrot", "Doughnut", "Egg"],
    "Price" : [.5, .3, .4, 1.0, .2],
    "In_Stock" : [True, True,False,True,False]
}
df_3 = pd.DataFrame(data_3)

df_3

    Product  Price  In_Stock
0     Apple    0.5      True
1    Banana    0.3      True
2    Carrot    0.4     False
3  Doughnut    1.0      True
4       Egg    0.2     False

In [19]:
df_3[df_3.loc[:,'In_Stock']].loc[:,'Product']

0       Apple
1      Banana
3    Doughnut
Name: Product, dtype: object

In [15]:
df_3.loc[3,"Price"] = 1.2

df_3

    Product  Price  In_Stock
0     Apple    0.5      True
1    Banana    0.3      True
2    Carrot    0.4     False
3  Doughnut    1.2      True
4       Egg    0.2     False

In [18]:
df_3[df_3["Price"] < .5].loc[:,'Product']

1    Banana
2    Carrot
4       Egg
Name: Product, dtype: object

In [21]:
df_3[df_3["In_Stock"]].loc[:,["Product", "Price"]]

    Product  Price
0     Apple    0.5
1    Banana    0.3
3  Doughnut    1.2